Thanks for the quick responses and information about validation. I must have misconfigured something else when trying this out in our project. After your comment I implemented an independent set of modules with the minimum configuration to demonstrate the use case and confirmed that does work in these cases.

**module-a**

config.tf
```
terraform {
  backend "s3" {
    bucket = "kuth"
    key    = "remote-state-test/module-a"
    region = "us-west-2"
  }
}
```

outputs.tf
```
output "foo" {
  value = "bar"
}
```

**module-b**

config.tf
```
terraform {
  backend "s3" {
    bucket = "kuth"
    key    = "remote-state-test/module-b"
    region = "us-west-2"
  }

  required_providers {
    local = {
      source  = "hashicorp/local"
      version = "2.4.0"
    }
  }
}
```

main.tf
```
data "terraform_remote_state" "module_a" {
  backend = "s3"
  config = {
    bucket = "kuth"
    key    = "remote-state-test/module-a"
    region = "us-west-2"
  }
}

resource "local_file" "test" {
  filename = "test.txt"
  content  = "TEST"
}

resource "local_file" "foo" {
  filename = "foo.txt"
  content  = data.terraform_remote_state.module_a.outputs.foo
}
```

outputs.tf
```
output "foo" {
  value = data.terraform_remote_state.module_a.outputs.foo
}
```

---

Case 1: Planning before the module that we depend on has been deployed at all

```
$ terraform plan
data.terraform_remote_state.module_a: Reading...

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # local_file.test will be created
  + resource "local_file" "test" {
      + content              = "TEST"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "test.txt"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Error: Unable to find remote state
│
│   with data.terraform_remote_state.module_a,
│   on main.tf line 1, in data "terraform_remote_state" "module_a":
│    1: data "terraform_remote_state" "module_a" {
│
│ No stored state was found for the given workspace in the given backend.
```

We'd like to be able to see what the plan would look like if the missing values were known.

Even if we add the following to the `terraform_remote_state` data source we still see the same error.
```
  defaults = {
    foo = "missing"
  }
```

---

Case 2: The dependency has already been deployed but we're adding a new output to it for use in the dependent module.

```
$ terraform plan
data.terraform_remote_state.module_a: Reading...
data.terraform_remote_state.module_a: Read complete after 1s

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # local_file.test will be created
  + resource "local_file" "test" {
      + content              = "TEST"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "test.txt"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Error: Unsupported attribute
│
│   on main.tf line 17, in resource "local_file" "foo":
│   17:   content  = data.terraform_remote_state.module_a.outputs.foo
│     ├────────────────
│     │ data.terraform_remote_state.module_a.outputs is object with no attributes
│
│ This object does not have an attribute named "foo".
╵
╷
│ Error: Unsupported attribute
│
│   on outputs.tf line 2, in output "foo":
│    2:   value = data.terraform_remote_state.module_a.outputs.foo
│     ├────────────────
│     │ data.terraform_remote_state.module_a.outputs is object with no attributes
│
│ This object does not have an attribute named "foo".
╵
```

In this case, adding the following to the `terraform_remote_state` data source will allow us to see what we want (a complete plan with dummy values for missing remote state outputs).
```
  defaults = {
    foo = "missing"
  }
```
```
$ terraform plan
data.terraform_remote_state.module_a: Reading...
data.terraform_remote_state.module_a: Read complete after 1s

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.foo will be created
  + resource "local_file" "foo" {
      + content              = "missing"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "foo.txt"
      + id                   = (known after apply)
    }

  # local_file.test will be created
  + resource "local_file" "test" {
      + content              = "TEST"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "test.txt"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + foo = "missing"
```

However, as far as I know we cannot prevent applying a plan that was generated using any missing values. We'd prefer an option that results in an error if that is attempted. If this pre-planning/dry-run ability was implemented as part of a "test" plan and terraform wouldn't let you apply "test" plans I think that would meet the need. But I do still wonder if it could just be a flag on the `terragrunt_remote_state` data source that lets the plan complete with the default values but then raises an error that makes the plan invalid and uses the "Terraform planned the following actions, but then encountered a problem:" output?

Anyway, I appreciate the time and consideration. Just wanted to confirm that I do see the validation behavior you mentioned and provide a better example of what we're hoping to do natively. We can continue to use terragrunt for this until if/when something similar makes its way into terraform.